function book() {
    var mima=prompt('输入想看的书')
    if (mima=='wg1'){
        alert('输入正确:)查看小说[文稿一]')
        document.write('<pre class="wz">“啊！！！”\n' +
            '巨大的岩石洞穴内摆放着各式各样的仪器，在一张“铁床”上躺着一只血肉模\n' +
            '糊的躯体，旁边是说不清的仪器正在忙碌。伴随着仪器的运作，床上的躯体发出\n' +
            '阵阵惨叫。\n' +
            '“哈哈，伟大的自然之神，因为您的眷顾，我的实验终于成功了。哈哈哈哈！ ”\n' +
            '在深处有人在兴奋的咆哮着。\n' +
            '“先生，完成后应该怎么做？”\n' +
            '“给它下上诅咒吧，不然等到将来还在不在我们的控制范围内就说不清了。”\n' +
            '“嗯。”\n' +
            '“动作要快，想必那群妖怪都急了。”\n' +
            '年长的人话语刚落洞内的惨叫声更加的惨烈了。\n' +
            '“快！快找！都七天了！灵儿还没找到，你们是废物么？”距离岩洞附近不远\n' +
            '处一红袍男子急促的对身旁的人影说着。\n' +
            '“族长，应该就在前面的山那里，”\n' +
            '“找到了！？快快快，事不宜迟，走！”\n' +
            '“是！”\n' +
            '瞬息之间，树林内人影飞逝，向岩石洞穴略去。不过他们的头顶有着各种色彩\n' +
            '的角。\n' +
            '“先生，完成了！”\n' +
            '年轻人看着洞内床上躯壳周围漂着的白色鳞片激动的说道，鳞片散发着淡淡的\n' +
            '荧光，光芒愈来愈淡，直至消失不见。\n' +
            '“好！好！完成了！”\n' +
            '随着时间的流逝床上的躯壳显现出来人的轮廓，不过混身尽是鲜血。\n' +
            '“好了，准备回去吧，时间能力就少用些吧。”\n' +
            '男子#h\n' +
            '“啊！！！”\n' +
            '巨大的岩石洞穴内摆放着各式各样的仪器，在一张“铁床”上躺着一只血肉模\n' +
            '糊的躯体，旁边是说不清的仪器正在忙碌。伴随着仪器的运作，床上的躯体发出\n' +
            '阵阵惨叫。\n' +
            '“哈哈，伟大的自然之神，因为您的眷顾，我的实验终于成功了。哈哈哈哈！ ”\n' +
            '在深处有人在兴奋的咆哮着。\n' +
            '“先生，完成后应该怎么做？”\n' +
            '“给它下上诅咒吧，不然等到将来还在不在我们的控制范围内就说不清了。”\n' +
            '“嗯。”\n' +
            '“动作要快，想必那群妖怪都急了。”\n' +
            '年长的人话语刚落洞内的惨叫声更加的惨烈了。\n' +
            '“快！快找！都七天了！灵儿还没找到，你们是废物么？”距离岩洞附近不远\n' +
            '处一红袍男子急促的对身旁的人影说着。\n' +
            '“族长，应该就在前面的山那里，”\n' +
            '“找到了！？快快快，事不宜迟，走！”\n' +
            '“是！”\n' +
            '瞬息之间，树林内人影飞逝，向岩石洞穴略去。不过他们的头顶有着各种色彩\n' +
            '的角。\n' +
            '“先生，完成了！”\n' +
            '年轻人看着洞内床上躯壳周围漂着的白色鳞片激动的说道，鳞片散发着淡淡的\n' +
            '荧光，光芒愈来愈淡，直至消失不见。\n' +
            '“好！好！完成了！”\n' +
            '随着时间的流逝床上的躯壳显现出来人的轮廓，不过混身尽是鲜血。\n' +
            '“好了，准备回去吧，时间能力就少用些吧。”\n' +
            '男子话语刚落，门外响起了一声巨响。\n' +
            '“贼子！还我孩儿！ ”却是红袍男子到了。</pre>')
    }
    if (mima=='ydcn'){
        alert('输入正确:)查看小说[妖的承诺]')
        document.write('<pre class="wz">  天上响着阵阵雷声，地上净是阵阵嘈杂。说不清的陈年旧事，数不清的车马人货，输不起争夺之战。\n' +
            '  没有太多的人知道这次争的是什么，只知道这次输不起，自己争不到别人就也不能争到！\n' +
            '  因为噬魔塔出来了！\n' +
            '  ………………\n' +
            '  密密麻麻的车队，回来的寥寥无几。\n' +
            '  没有人愿提起那段记忆，因为哪怕只是回忆，同样是那么的，令人心生恐惧。\n' +
            '  不会提起，但记忆如同梦魇一般挥之不去，日复一日的折磨着回来的人。\n' +
            '  那\n</pre>')
    }
    if (mima==null){
        alert('输入为空:D')
    }
}